CSI API ETABS v1
cCombo.GetNameList Method
 Retrieves the names of all defined response combinations.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameList(
	ref int NumberNames,
	ref string[] MyName
)
Function GetNameList (
	ByRef NumberNames As Integer,
	ByRef MyName As String()
) As Integer
Dim instance As cCombo
Dim NumberNames As Integer
Dim MyName As String()
Dim returnValue As Integer
returnValue = instance.GetNameList(NumberNames,
	MyName)
int GetNameList(
	int% NumberNames,
	array<String^>^% MyName
)
abstract GetNameList :
        NumberNames : int byref *
        MyName : string[] byref -> int
Parameters
NumberNames
Type: System.Int32
 The number of load combination names retrieved by the program.
MyName
Type: System.String[]
 This is a one-dimensional array of load combination names. The MyName array is created as a dynamic, zero-based, array by the API user:
Dim MyName() as String
 The array is dimensioned to (NumberNames – 1) inside the ETABS program, filled with the names, and returned to the API user.
Return Value
Type: Int32
 Returns zero if the names are successfully retrieved, otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberNames As Integer
       Dim MyName() As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add combos
       ret = SapModel.RespCombo.Add("COMB1", 0)
       ret = SapModel.RespCombo.Add("COMB2", 2)
   'get combo names
       ret = SapModel.RespCombo.GetNameList(NumberNames, MyName)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cCombo Interface
ETABSv1 Namespace